rottenpotatoes/app/controllers/movies_controller.rb

  def find_same_director
    @movie = Movie.find(params[:id])
	movie_director = @movie.director
	if movie_director.empty?
	  flash[:notice] = "'#{@movie.title}' has no director info."
	  redirect_to movies_path
	else
	  @movies = Movie.where(Director: movie_director)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "George Lucas"]]